Repository: ArduanovDanil/hydrator
Catalog: docs/po/mapping.md/*/mapping.md.*.po
Languages: ru

source: Mapping
ru: Маппинг (сопоставление)

source: In many cases, class attribute names differ from data keys you fill and/or create objects of the class with. For example, we have a blog post class:
ru: Во многих случаях, имена атрибутов класса отличаются от ключей данных, которыми вы заполняете и/или создаете объекты класса. Например, у вас есть класс постов блога:

source: But the data you have has differently named keys:
ru: Но данные, которые у вас есть, имеют другие названия ключей:

source: Hydrator allows you to map data:
ru: Гидратор позволяет вам сопоставить данные:

source: This way we take `header` key for `title` and `text` key for `body`.
ru: Таким образом, мы берем ключ `header` для `title` и ключ `text` для `body`.

source: For nested objects mapping you can use `ObjectMap` class:
ru: Для вложенных объектов вы можете использовать класс `ObjectMap`:

source: Strict mode
ru: Строгий режим

source: You can enable strict mode by passing `true` as a third argument of `ArrayData`:
ru: Вы можете включить строгий режим, передавая `true` как третий аргумент в `ArrayData`:

source: In this case, keys absent from the map are ignored so everything should be mapped explicitly.
ru: В этом случае ключи, отсутствующие в сопоставлении, будут проигнорированы, поэтому все ключи необходимо сопоставлять явно.

source: Using attributes
ru: Использование атрибутов

source: Alternatively to specifying mapping as an array, you can use `Data` attribute to define mapping inline:
ru: В качестве альтернативы указанию сопоставления в виде массива, вы можете использовать атрибут `Data` для определения сопоставления внутри самого класса:

source: To skip hydration of a specific property, use `SkipHydration` attribute:
ru: Чтобы пропустить заполнение определенного свойства используйте атрибут `SkipHydration`:

source: Resolving dependencies
ru: Разрешение зависимостей

source: To resolve dependencies by specific ID using DI container, use `Di` attribute:
ru: Для разрешения зависимостей для конкретного ID используйте DI-контейнер через атрибут `Di`:

source: The annotation will instruct hydrator to get `$connection` from DI container by `importConnection` ID.
ru: Аннотация указывает гидратору получить `$connection` из DI-контейнера по ID `importConnection`.
