Repository: ArduanovDanil/hydrator
Catalog: docs/po/creating-own-attributes.md/*/creating-own-attributes.md.*.po
Languages: ru

source: Creating own attributes
ru: Создание собственных атрибутов

source: There are two main parts of an attribute:
ru: Атрибут состоит из двух основных частей:

source: **Attribute class**. It only stores configuration options and a reference to its handler.
ru: **Класс атрибута**. В нем хранятся только параметры конфигурации и ссылка на свой обработчик.

source: **Attribute resolver**. Given an attribute reflection and extra data, it resolves an attribute.
ru: **Обработчик атрибута**. Учитывая рефлексию и дополнительные данные, он определяет атрибут.

source: Besides responsibilities' separation, this approach allows the package to automatically resolve dependencies for attribute resolver.
ru: Помимо разделения ответственности, такой подход позволяет пакету автоматически разрешать зависимости для обработчика атрибутов.

source: Data attributes
ru: Атрибуты данных

source: You apply data attributes to a whole class. The main goal is getting data from external sources such as from request. Additionally, it's possible to specify how external source attributes map to hydrated class.
ru: Атрибуты данных применяются ко всему классу. Основная цель - получение данных из внешних источников, например, из запроса. Кроме того, можно указать, как атрибуты внешнего источника сопоставляются с гидрируемым классом.

source: Data attribute class should implement `DataAttributeInterface` and the corresponding data attribute resolver should implement `DataAttributeResolverInterface`.
ru: Класс атрибутов данных должен реализовывать `DataAttributeInterface`, а соответствующий обработчик атрибутов должен реализовывать `DataAttributeResolverInterface`.

source: Example of custom data attribute
ru: Пример пользовательского атрибута данных

source: For example, let's create a data attribute that uses predefined array as data for object populating.
ru: Для примера давайте создадим атрибут данных, который использует переданный массив в качестве данных для заполнения объекта.

source: Attribute:
ru: Атрибут:

source: Resolver:
ru: Обработчик:

source: Parameter attributes
ru: Атрибуты параметров

source: You apply parameter attributes to class properties and constructor parameters. You use these attributes for getting value for specific parameter or for preparing the value (for example, by type casting).
ru: Атрибуты параметров применяются к свойствам класса и параметрам конструктора. Эти атрибуты используются для получения значения конкретного параметра или для подготовки значения (например, приведения типов).

source: Parameter attribute class should implement `ParameterAttributeInterface` and the corresponding parameter attribute resolver should implement `ParameterAttributeResolverInterface`.
ru: Класс параметра атрибутов должен реализовывать `ParameterAttributeInterface`, а соответствующий обработчик атрибутов должен реализовывать `ParameterAttributeResolverInterface`.

source: Example of custom parameter attribute
ru: Пример пользовательского атрибута свойства

source: For example, let's create a parameter attribute that provides a random value for object property.
ru: Например, давайте создадим атрибут свойства, который возвращает случайное значение для свойства объекта.

source: Using a single class for both attribute and resolver
ru: Использование одного класса как для атрибута, так и для обработчика

source: If your attribute is simple and doesn't require dependencies, you can combine attribute and its resolver in a single class. For example:
ru: Если ваши атрибуты простые и не требуют зависимостей, вы можете скомбинировать атрибуты и их обработчик в одном классе. Например:
